## Get the Data

Either use the provided .csv file or (optionally) get fresh (the freshest?) data from running an SQL query on StackExchange: 

Follow this link to run the query from [StackExchange](https://data.stackexchange.com/stackoverflow/query/675441/popular-programming-languages-per-over-time-eversql-com) to get your own .csv file

<code>
select dateadd(month, datediff(month, 0, q.CreationDate), 0) m, TagName, count(*)
from PostTags pt
join Posts q on q.Id=pt.PostId
join Tags t on t.Id=pt.TagId
where TagName in ('java','c','c++','python','c#','javascript','assembly','php','perl','ruby','visual basic','swift','r','object-c','scratch','go','swift','delphi')
and q.CreationDate < dateadd(month, datediff(month, 0, getdate()), 0)
group by dateadd(month, datediff(month, 0, q.CreationDate), 0), TagName
order by dateadd(month, datediff(month, 0, q.CreationDate), 0)
</code>

## Import Statements

In [1]:
import pandas as pd

## Data Exploration

**Challenge**: Read the .csv file and store it in a Pandas dataframe

In [2]:
data=pd.read_csv('QueryResults.csv',names=["Date","Tag","Posts"])

**Challenge**: Examine the first 5 rows and the last 5 rows of the of the dataframe

In [3]:
data.head()
data.tail()

                     Date    Tag   Posts
1987  2020-07-01 00:00:00      r  5694.0
1988  2020-07-01 00:00:00     go   743.0
1989  2020-07-01 00:00:00   ruby   775.0
1990  2020-07-01 00:00:00   perl   182.0
1991  2020-07-01 00:00:00  swift  3607.0

**Challenge:** Check how many rows and how many columns there are. 
What are the dimensions of the dataframe?

In [4]:
data.shape

(1992, 3)

**Challenge**: Count the number of entries in each column of the dataframe

In [5]:
data.count()

Date     1992
Tag      1992
Posts    1991
dtype: int64

**Challenge**: Calculate the total number of post per language.
Which Programming language has had the highest total number of posts of all time?

In [6]:
data.groupby('Tag').sum()

                Posts
Tag
TagName           0.0
assembly      34852.0
c            336042.0
c#          1423530.0
c++          684210.0
delphi        46212.0
go            47499.0
java        1696403.0
javascript  2056510.0
perl          65286.0
php         1361988.0
python      1496210.0
r            356799.0
ruby         214582.0
swift        273055.0

Some languages are older (e.g., C) and other languages are newer (e.g., Swift). The dataset starts in September 2008.

**Challenge**: How many months of data exist per language? Which language had the fewest months with an entry?

In [7]:
data.groupby('Tag').count()

            Date  Posts
Tag
TagName        1      0
assembly     144    144
c            144    144
c#           145    145
c++          144    144
delphi       144    144
go           129    129
java         144    144
javascript   144    144
perl         144    144
php          144    144
python       144    144
r            142    142
ruby         144    144
swift        135    135

## Data Cleaning

Let's fix the date format to make it more readable. We need to use Pandas to change format from a string of "2008-07-01 00:00:00" to a datetime object with the format of "2008-07-01"

In [37]:
data.Date=pd.to_datetime(data.Date[1])
data.head()

        Date         Tag  Posts
0 2008-07-01     TagName    NaN
1 2008-07-01          c#    3.0
2 2008-07-01    assembly    8.0
3 2008-07-01  javascript  162.0
4 2008-07-01           c   85.0

## Data Manipulation

**Challenge**: What are the dimensions of our new dataframe? How many rows and columns does it have? Print out the column names and print out the first 5 rows of the dataframe.

In [38]:
test_df = pd.DataFrame({'Age': ['Young', 'Young', 'Young', 'Young', 'Old', 'Old', 'Old', 'Old'],
                        'Actor': ['Jack', 'Arnold', 'Keanu', 'Sylvester', 'Jack', 'Arnold', 'Keanu', 'Sylvester'],
                        'Power': [100, 80, 25, 50, 99, 75, 5, 30]})
test_df

     Age      Actor  Power
0  Young       Jack    100
1  Young     Arnold     80
2  Young      Keanu     25
3  Young  Sylvester     50
4    Old       Jack     99
5    Old     Arnold     75
6    Old      Keanu      5
7    Old  Sylvester     30

In [39]:
pivot_df=test_df.pivot(index='Age',columns='Actor',values='Power')
pivot_df

Actor  Arnold  Jack  Keanu  Sylvester
Age
Old        75    99      5         30
Young      80   100     25         50

## Data Visualisaton with with Matplotlib

**Challenge**: Use the [matplotlib documentation](https://matplotlib.org/3.2.1/api/_as_gen/matplotlib.pyplot.plot.html#matplotlib.pyplot.plot) to plot a single programming language (e.g., java) on a chart.

In [42]:
import matplotlib.pyplot as plt

**Challenge**: Show two line (e.g. for Java and Python) on the same chart.

# Smoothing out Time Series Data

Time series data can be quite noisy, with a lot of up and down spikes. To better see a trend we can plot an average of, say 6 or 12 observations. This is called the rolling mean. We calculate the average in a window of time and move it forward by one overservation. Pandas has two handy methods already built in to work this out: [rolling()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html) and [mean()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.window.rolling.Rolling.mean.html).